Moyaoyyy/SmartEquipmentCabinet_LwIP-STM32Net/mcu/bsp/lcd/Inc/bsp_lcd.h
#ifndef __LCD_H
#define __LCD_H

#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"
#include "bsp_sdram.h"
#include "fonts.h"

typedef struct
{
    int16_t X;
    int16_t Y;
} Point, *pPoint;

/* LCD 物理像素大小 (宽度和高度) */
#define LCD_PIXEL_WIDTH ((uint16_t)800)
#define LCD_PIXEL_HEIGHT ((uint16_t)480)

/*根据液晶数据手册的参数配置*/
#define HBP 46 // HSYNC后的无效像素
#define VBP 23 // VSYNC后的无效行数

#define HSW 1 // HSYNC宽度
#define VSW 1 // VSYNC宽度

#define HFP 22 // HSYNC前的无效像素
#define VFP 22 // VSYNC前的无效行数

#define LCD_FRAME_BUFFER ((uint32_t)0xD0000000)
#define BUFFER_OFFSET ((uint32_t)800 * 480 * 2)

/**
 * @brief  LCD color
 */
/*
 *   使用以下两组颜色必须跟LCD_LayerInit()函数中对每层的设置对应，不然会导致颜色显示错误。
 * 特别为实现两层同时正常显示需要把上层(LCD_FOREGROUND_LAYER)设置为LTDC_Pixelformat_ARGB1555
 * 格式，对应的必须使用LCD_COLOR1555_XXX颜色，该格式在1位透明控制位，可以实现没有实际颜色填
 * 充的像素点通透显示,从而使得显示下层(LCD_BACKGROUND_LAYER)成为可能。如果上层是使用
 * LTDC_Pixelformat_ARGB565格式设置是无法正常显示双层的。
 *   当然，可以把下层设置为LTDC_Pixelformat_ARGB1555格式，使用用LCD_COLOR1555_XXX也是可以正
 * 常显示的。
 * 特别注意：ARGB1555其中的A对应开发板液晶来说设置为1表示不透明，设置为0表透明。
 */
// RGB565
#define LCD_COLOR565_WHITE 0xFFFF   // 11111 111111 11111
#define LCD_COLOR565_BLACK 0x0000   // 00000 000000 00000
#define LCD_COLOR565_GREY 0xF7DE    // 11110 111110 11110
#define LCD_COLOR565_BLUE 0x001F    // 00000 000000 11111
#define LCD_COLOR565_BLUE2 0x051F   // 00000 101000 11111
#define LCD_COLOR565_RED 0xF800     // 11111 000000 00000
#define LCD_COLOR565_MAGENTA 0xF81F // 11111 000000 11111
#define LCD_COLOR565_GREEN 0x07E0   // 00000 111111 00000
#define LCD_COLOR565_CYAN 0x7FFF    // 01111 111111 11111
#define LCD_COLOR565_YELLOW 0xFFE0  // 11111 111111 00000

// ARGB1555
#define LCD_COLOR1555_WHITE 0xFFFF   // 1 11111 11111 11111
#define LCD_COLOR1555_BLACK 0x8000   // 1 00000 00000 00000
#define LCD_COLOR1555_GREY 0xFBFE    // 1 11110 11111 11110
#define LCD_COLOR1555_BLUE 0x801F    // 1 00000 00000 11111
#define LCD_COLOR1555_BLUE2 0x829F   // 1 00000 10100 11111
#define LCD_COLOR1555_RED 0xFC00     // 1 11111 00000 00000
#define LCD_COLOR1555_MAGENTA 0xFC1F // 1 11111 00000 11111
#define LCD_COLOR1555_GREEN 0x83E0   // 1 00000 11111 00000
#define LCD_COLOR1555_CYAN 0xBFFF    // 1 01111 11111 11111
#define LCD_COLOR1555_YELLOW 0xFFE0  // 1 11111 11111 00000
#define LCD_COLOR1555_CLEAR 0

/*默认颜色，RGB565与RGB888通用接口*/
#define LCD_COLOR_WHITE LCD_COLOR1555_WHITE // 白色
#define LCD_COLOR_BLACK LCD_COLOR1555_BLACK // 红色
#define LCD_COLOR_GREY LCD_COLOR1555_GREY
#define LCD_COLOR_BLUE LCD_COLOR1555_BLUE
#define LCD_COLOR_BLUE2 LCD_COLOR1555_BLUE2
#define LCD_COLOR_RED LCD_COLOR1555_RED // 菊黄色
#define LCD_COLOR_MAGENTA LCD_COLOR1555_MAGENTA
#define LCD_COLOR_GREEN LCD_COLOR1555_GREEN
#define LCD_COLOR_CYAN LCD_COLOR1555_CYAN
#define LCD_COLOR_YELLOW LCD_COLOR1555_YELLOW // 亮黄色

#define TRANSPARENCY 0x7FFF // 透明
/**
 * @brief  LCD Lines depending on the chosen fonts.
 */
#define LCD_LINE_0 LINE(0)
#define LCD_LINE_1 LINE(1)
#define LCD_LINE_2 LINE(2)
#define LCD_LINE_3 LINE(3)
#define LCD_LINE_4 LINE(4)
#define LCD_LINE_5 LINE(5)
#define LCD_LINE_6 LINE(6)
#define LCD_LINE_7 LINE(7)
#define LCD_LINE_8 LINE(8)
#define LCD_LINE_9 LINE(9)
#define LCD_LINE_10 LINE(10)
#define LCD_LINE_11 LINE(11)
#define LCD_LINE_12 LINE(12)
#define LCD_LINE_13 LINE(13)
#define LCD_LINE_14 LINE(14)
#define LCD_LINE_15 LINE(15)
#define LCD_LINE_16 LINE(16)
#define LCD_LINE_17 LINE(17)
#define LCD_LINE_18 LINE(18)
#define LCD_LINE_19 LINE(19)
#define LCD_LINE_20 LINE(20)
#define LCD_LINE_21 LINE(21)
#define LCD_LINE_22 LINE(22)
#define LCD_LINE_23 LINE(23)
#define LCD_LINE_24 LINE(24)
#define LCD_LINE_25 LINE(25)
#define LCD_LINE_26 LINE(26)
#define LCD_LINE_27 LINE(27)
#define LCD_LINE_28 LINE(28)
#define LCD_LINE_29 LINE(29)
#define LCD_LINE_30 LINE(30)
#define LCD_LINE_31 LINE(31)
#define LCD_LINE_32 LINE(32)
#define LCD_LINE_33 LINE(33)
#define LCD_LINE_34 LINE(34)
#define LCD_LINE_35 LINE(35)
#define LCD_LINE_36 LINE(36)
#define LCD_LINE_37 LINE(37)
#define LCD_LINE_38 LINE(38)
#define LCD_LINE_39 LINE(39)
/**
 * @brief LCD default font
 */
#define LCD_DEFAULT_FONT Font16x24
/**
 * @brief  LCD Direction
 */
#define LCD_DIR_HORIZONTAL 0x0000
#define LCD_DIR_VERTICAL 0x0001
/**
 * @brief  LCD Layer
 */
#define LCD_BACKGROUND_LAYER 0x0000
#define LCD_FOREGROUND_LAYER 0x0001
/** @defgroup DISCOVERY_LCD_Exported_Macros
 * @{
 */
#define ASSEMBLE_RGB(R, G, B) ((((R) & 0xF8) << 8) | (((G) & 0xFC) << 3) | (((B) & 0xF8) >> 3))

/*部分液晶信号线的引脚复用编号是AF9*/
#define GPIO_AF_LTDC_AF9 ((uint8_t)0x09)
// 红色数据线
#define LTDC_R0_GPIO_PORT GPIOH
#define LTDC_R0_GPIO_CLK RCC_AHB1Periph_GPIOH
#define LTDC_R0_GPIO_PIN GPIO_Pin_2
#define LTDC_R0_PINSOURCE GPIO_PinSource2
#define LTDC_R0_AF GPIO_AF_LTDC

#define LTDC_R1_GPIO_PORT GPIOH
#define LTDC_R1_GPIO_CLK RCC_AHB1Periph_GPIOH
#define LTDC_R1_GPIO_PIN GPIO_Pin_3
#define LTDC_R1_PINSOURCE GPIO_PinSource3
#define LTDC_R1_AF GPIO_AF_LTDC

#define LTDC_R2_GPIO_PORT GPIOH
#define LTDC_R2_GPIO_CLK RCC_AHB1Periph_GPIOH
#define LTDC_R2_GPIO_PIN GPIO_Pin_8
#define LTDC_R2_PINSOURCE GPIO_PinSource8
#define LTDC_R2_AF GPIO_AF_LTDC

#define LTDC_R3_GPIO_PORT GPIOB
#define LTDC_R3_GPIO_CLK RCC_AHB1Periph_GPIOB
#define LTDC_R3_GPIO_PIN GPIO_Pin_0
#define LTDC_R3_PINSOURCE GPIO_PinSource0
#define LTDC_R3_AF GPIO_AF_LTDC_AF9

#define LTDC_R4_GPIO_PORT GPIOA
#define LTDC_R4_GPIO_CLK RCC_AHB1Periph_GPIOA
#define LTDC_R4_GPIO_PIN GPIO_Pin_11
#define LTDC_R4_PINSOURCE GPIO_PinSource11
#define LTDC_R4_AF GPIO_AF_LTDC

#define LTDC_R5_GPIO_PORT GPIOA
#define LTDC_R5_GPIO_CLK RCC_AHB1Periph_GPIOA
#define LTDC_R5_GPIO_PIN GPIO_Pin_12
#define LTDC_R5_PINSOURCE GPIO_PinSource12
#define LTDC_R5_AF GPIO_AF_LTDC

#define LTDC_R6_GPIO_PORT GPIOB
#define LTDC_R6_GPIO_CLK RCC_AHB1Periph_GPIOB
#define LTDC_R6_GPIO_PIN GPIO_Pin_1
#define LTDC_R6_PINSOURCE GPIO_PinSource1
#define LTDC_R6_AF GPIO_AF_LTDC_AF9

#define LTDC_R7_GPIO_PORT GPIOG
#define LTDC_R7_GPIO_CLK RCC_AHB1Periph_GPIOG
#define LTDC_R7_GPIO_PIN GPIO_Pin_6
#define LTDC_R7_PINSOURCE GPIO_PinSource6
#define LTDC_R7_AF GPIO_AF_LTDC
// 绿色数据线
#define LTDC_G0_GPIO_PORT GPIOE
#define LTDC_G0_GPIO_CLK RCC_AHB1Periph_GPIOE
#define LTDC_G0_GPIO_PIN GPIO_Pin_5
#define LTDC_G0_PINSOURCE GPIO_PinSource5
#define LTDC_G0_AF GPIO_AF_LTDC

#define LTDC_G1_GPIO_PORT GPIOE
#define LTDC_G1_GPIO_CLK RCC_AHB1Periph_GPIOE
#define LTDC_G1_GPIO_PIN GPIO_Pin_6
#define LTDC_G1_PINSOURCE GPIO_PinSource6
#define LTDC_G1_AF GPIO_AF_LTDC

#define LTDC_G2_GPIO_PORT GPIOH
#define LTDC_G2_GPIO_CLK RCC_AHB1Periph_GPIOH
#define LTDC_G2_GPIO_PIN GPIO_Pin_13
#define LTDC_G2_PINSOURCE GPIO_PinSource13
#define LTDC_G2_AF GPIO_AF_LTDC

#define LTDC_G3_GPIO_PORT GPIOG
#define LTDC_G3_GPIO_CLK RCC_AHB1Periph_GPIOG
#define LTDC_G3_GPIO_PIN GPIO_Pin_10
#define LTDC_G3_PINSOURCE GPIO_PinSource10
#define LTDC_G3_AF GPIO_AF_LTDC_AF9

#define LTDC_G4_GPIO_PORT GPIOH
#define LTDC_G4_GPIO_CLK RCC_AHB1Periph_GPIOH
#define LTDC_G4_GPIO_PIN GPIO_Pin_15
#define LTDC_G4_PINSOURCE GPIO_PinSource15
#define LTDC_G4_AF GPIO_AF_LTDC

#define LTDC_G5_GPIO_PORT GPIOI
#define LTDC_G5_GPIO_CLK RCC_AHB1Periph_GPIOI
#define LTDC_G5_GPIO_PIN GPIO_Pin_0
#define LTDC_G5_PINSOURCE GPIO_PinSource0
#define LTDC_G5_AF GPIO_AF_LTDC

#define LTDC_G6_GPIO_PORT GPIOC
#define LTDC_G6_GPIO_CLK RCC_AHB1Periph_GPIOC
#define LTDC_G6_GPIO_PIN GPIO_Pin_7
#define LTDC_G6_PINSOURCE GPIO_PinSource7
#define LTDC_G6_AF GPIO_AF_LTDC

#define LTDC_G7_GPIO_PORT GPIOI
#define LTDC_G7_GPIO_CLK RCC_AHB1Periph_GPIOI
#define LTDC_G7_GPIO_PIN GPIO_Pin_2
#define LTDC_G7_PINSOURCE GPIO_PinSource2
#define LTDC_G7_AF GPIO_AF_LTDC

// 蓝色数据线
#define LTDC_B0_GPIO_PORT GPIOE
#define LTDC_B0_GPIO_CLK RCC_AHB1Periph_GPIOE
#define LTDC_B0_GPIO_PIN GPIO_Pin_4
#define LTDC_B0_PINSOURCE GPIO_PinSource4
#define LTDC_B0_AF GPIO_AF_LTDC

#define LTDC_B1_GPIO_PORT GPIOG
#define LTDC_B1_GPIO_CLK RCC_AHB1Periph_GPIOG
#define LTDC_B1_GPIO_PIN GPIO_Pin_12
#define LTDC_B1_PINSOURCE GPIO_PinSource12
#define LTDC_B1_AF GPIO_AF_LTDC

#define LTDC_B2_GPIO_PORT GPIOD
#define LTDC_B2_GPIO_CLK RCC_AHB1Periph_GPIOD
#define LTDC_B2_GPIO_PIN GPIO_Pin_6
#define LTDC_B2_PINSOURCE GPIO_PinSource6
#define LTDC_B2_AF GPIO_AF_LTDC

#define LTDC_B3_GPIO_PORT GPIOG
#define LTDC_B3_GPIO_CLK RCC_AHB1Periph_GPIOG
#define LTDC_B3_GPIO_PIN GPIO_Pin_11
#define LTDC_B3_PINSOURCE GPIO_PinSource11
#define LTDC_B3_AF GPIO_AF_LTDC

#define LTDC_B4_GPIO_PORT GPIOI
#define LTDC_B4_GPIO_CLK RCC_AHB1Periph_GPIOI
#define LTDC_B4_GPIO_PIN GPIO_Pin_4
#define LTDC_B4_PINSOURCE GPIO_PinSource4
#define LTDC_B4_AF GPIO_AF_LTDC

#define LTDC_B5_GPIO_PORT GPIOA
#define LTDC_B5_GPIO_CLK RCC_AHB1Periph_GPIOA
#define LTDC_B5_GPIO_PIN GPIO_Pin_3
#define LTDC_B5_PINSOURCE GPIO_PinSource3
#define LTDC_B5_AF GPIO_AF_LTDC

#define LTDC_B6_GPIO_PORT GPIOB
#define LTDC_B6_GPIO_CLK RCC_AHB1Periph_GPIOB
#define LTDC_B6_GPIO_PIN GPIO_Pin_8
#define LTDC_B6_PINSOURCE GPIO_PinSource8
#define LTDC_B6_AF GPIO_AF_LTDC

#define LTDC_B7_GPIO_PORT GPIOB
#define LTDC_B7_GPIO_CLK RCC_AHB1Periph_GPIOB
#define LTDC_B7_GPIO_PIN GPIO_Pin_9
#define LTDC_B7_PINSOURCE GPIO_PinSource9
#define LTDC_B7_AF GPIO_AF_LTDC

// 控制信号线
#define LTDC_CLK_GPIO_PORT GPIOG
#define LTDC_CLK_GPIO_CLK RCC_AHB1Periph_GPIOG
#define LTDC_CLK_GPIO_PIN GPIO_Pin_7
#define LTDC_CLK_PINSOURCE GPIO_PinSource7
#define LTDC_CLK_AF GPIO_AF_LTDC

#define LTDC_HSYNC_GPIO_PORT GPIOI
#define LTDC_HSYNC_GPIO_CLK RCC_AHB1Periph_GPIOI
#define LTDC_HSYNC_GPIO_PIN GPIO_Pin_10
#define LTDC_HSYNC_PINSOURCE GPIO_PinSource10
#define LTDC_HSYNC_AF GPIO_AF_LTDC

#define LTDC_VSYNC_GPIO_PORT GPIOI
#define LTDC_VSYNC_GPIO_CLK RCC_AHB1Periph_GPIOI
#define LTDC_VSYNC_GPIO_PIN GPIO_Pin_9
#define LTDC_VSYNC_PINSOURCE GPIO_PinSource9
#define LTDC_VSYNC_AF GPIO_AF_LTDC

#define LTDC_DE_GPIO_PORT GPIOF
#define LTDC_DE_GPIO_CLK RCC_AHB1Periph_GPIOF
#define LTDC_DE_GPIO_PIN GPIO_Pin_10
#define LTDC_DE_PINSOURCE GPIO_PinSource10
#define LTDC_DE_AF GPIO_AF_LTDC

#define LTDC_DISP_GPIO_PORT GPIOD
#define LTDC_DISP_GPIO_CLK RCC_AHB1Periph_GPIOD
#define LTDC_DISP_GPIO_PIN GPIO_Pin_4

#define LTDC_BL_GPIO_PORT GPIOD
#define LTDC_BL_GPIO_CLK RCC_AHB1Periph_GPIOD
#define LTDC_BL_GPIO_PIN GPIO_Pin_7

/** @defgroup LCD_Exported_Functions
 * @{
 */
void LCD_Init(void);
void LCD_LayerInit(void);
void LCD_SetLayer(uint32_t Layerx);
void LCD_SetColors(uint16_t _TextColor, uint16_t _BackColor);
void LCD_GetColors(uint16_t *_TextColor, uint16_t *_BackColor);
void LCD_SetTextColor(uint16_t Color);
void LCD_SetBackColor(uint16_t Color);
void LCD_SetTransparency(uint8_t transparency);
void LCD_ClearLine(uint16_t Line);
void LCD_Clear(uint16_t Color);
uint32_t LCD_SetCursor(uint16_t Xpos, uint16_t Ypos);
void LCD_SetColorKeying(uint32_t RGBValue);
void LCD_ReSetColorKeying(void);
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint16_t *c);
void LCD_DisplayChar(uint16_t Line, uint16_t Column, uint8_t Ascii);
void LCD_SetFont(sFONT *fonts);
sFONT *LCD_GetFont(void);
void LCD_DisplayStringLine(uint16_t Line, uint8_t *ptr);
void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width);
void LCD_WindowModeDisable(void);
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction);
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height);
void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius);
void LCD_DrawEllipse(int Xpos, int Ypos, int Radius, int Radius2);
void LCD_DrawFullEllipse(int Xpos, int Ypos, int Radius, int Radius2);
void LCD_DrawMonoPict(const uint32_t *Pict);
void LCD_WriteBMP(uint32_t BmpAddress);
void LCD_DrawUniLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2);
void LCD_DrawFullRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height);
void LCD_DrawFullCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius);
void LCD_PolyLine(pPoint Points, uint16_t PointCount);
void LCD_PolyLineRelative(pPoint Points, uint16_t PointCount);
void LCD_ClosedPolyLine(pPoint Points, uint16_t PointCount);
void LCD_ClosedPolyLineRelative(pPoint Points, uint16_t PointCount);
void LCD_FillPolyLine(pPoint Points, uint16_t PointCount);
void LCD_Triangle(pPoint Points, uint16_t PointCount);
void LCD_FillTriangle(uint16_t x1, uint16_t x2, uint16_t x3, uint16_t y1, uint16_t y2, uint16_t y3);
void LCD_CtrlLinesWrite(GPIO_TypeDef *GPIOx, uint16_t CtrlPins, BitAction BitVal);
void PutPixel(int16_t x, int16_t y);

/*汉字*/
void LCD_DispChar_CH(uint16_t usX, uint16_t usY, uint16_t usChar);
void LCD_DispString_EN_CH(uint16_t usX, uint16_t usY, const uint8_t *pStr);
void LCD_DisplayStringLine_EN_CH(uint16_t Line, uint8_t *ptr);
void LCD_DispString_EN_CH(uint16_t usX, uint16_t usY, const uint8_t *pStr);

#endif /* __LCD_H */
